<?php

// Include Moodle configuration file
//require_once(dirname(__FILE__) . '/../../config.php');
//require_once('../../../../config.php');


//function xmldb_survey_install() {
global $DB;


// Define data to be inserted
$data = array(
    array('id' => 1, 'name' => 'ยุทธศาสตร์ที่ ๑ การสร้างเมืองปลอดภัยและหยุ่นตัวต่อวิกฤตการณ์'),
    array('id' => 2, 'name' => 'ยุทธศาสตร์ที่ ๒ การพัฒนาสิ่งแวดล้อมยั่งยืนและการเปลี่ยนแปลงสภาพภูมิอากาศ'),
    array('id' => 3, 'name' => 'ยุทธศาสตร์ที่ ๓ การลดความเหลื่อมล้ำด้วยการบริหารเมืองรูปแบบอารยะสำหรับทุกคน'),
    array('id' => 4, 'name' => 'ยุทธศาสตร์ที่ ๔ การเชื่อมโยงเมืองที่มีความคล่องตัวและระบบบริการสาธารณะแบบบูรณาการ'),
    array('id' => 5, 'name' => 'ยุทธศาสตร์ที่ ๕ ส่งเสริมการสร้างเมืองประชาธิปไตยแบบมีส่วนร่วม'),
    array('id' => 6, 'name' => 'ยุทธศาสตร์ที่ ๖ การต่อยอดความเป็นเมืองศูนย์กลางเศรษฐกิจสร้างสรรค์และการเรียนรู้'),
    array('id' => 7, 'name' => 'ยุทธศาสตร์ที่ ๗ การสร้างความเป็นมืออาชีพในการบริหารจัดการมหานคร')
);

// Insert data into the database
foreach ($data as $record) {
    $DB->insert_record('strategic', (object) $record);
}



// Define data to be inserted
$data = array(
    array('id' => 1, 'name' => 'ยุทธศาสตร์ย่อยที่ ๑.๑ ปลอดอาชญากรรมและยาเสพติด', 'strategic_id' => 1),
    array('id' => 2, 'name' => 'ยุทธศาสตร์ย่อยที่ ๑.๒ ปลอดอุบัติเหตุ', 'strategic_id' => 1),
    array('id' => 3, 'name' => 'ยุทธศาสตร์ย่อยที่ ๑.๓ ปลอดภัยพิบัต', 'strategic_id' => 1),
    array('id' => 4, 'name' => 'ยุทธศาสตร์ย่อยที่ ๑.๔ ปลอดอุบัติภัยจากสิ่งก่อสร้าง', 'strategic_id' => 1),
    array('id' => 5, 'name' => 'ยุทธศาสตร์ย่อยที่ ๑.๕ เมืองสุขภาพดี (Healthy City)', 'strategic_id' => 1),
    array('id' => 6, 'name' => 'ยุทธศาสตร์ย่อยที่ ๒.๑ คุณภาพสิ่งแวดล้อมยั่งยืน', 'strategic_id' => 2),
    array('id' => 7, 'name' => 'ยุทธศาสตร์ย่อยที่ ๒.๒ พื้นที่สีเขียวเพื่อสุขภาวะที่ดีและมีความยั่งยืนด้านสิ่งแวดล้อมตามมาตรฐานสากล', 'strategic_id' => 2),
    array('id' => 8, 'name' => 'ยุทธศาสตร์ย่อยที่ ๒.๓ สังคมคาร์บอนต่ำและการรับมือต่อการเปลี่ยนแปลงสภาพภูมิอากาศ', 'strategic_id' => 2),
    array('id' => 9, 'name' => 'ยุทธศาสตร์ย่อยที่ ๒.๔ เมืองที่ใช้พลังงานอย่างมีประสิทธิภาพสูงและเป็นมิตรต่อสิ่งแวดล้อม', 'strategic_id' => 2),
    array('id' => 10, 'name' => 'ยุทธศาสตร์ย่อยที่ ๓.๑ ผู้สูงอายุ คนพิการ และผู้ด้อยโอกาสได้รับการดูแลอย่างครบวงจร', 'strategic_id' => 3),
    array('id' => 11, 'name' => 'ยุทธศาสตร์ย่อยที่ ๓.๒ เมืองแห่งโอกาสทางสังคม', 'strategic_id' => 3),
    array('id' => 12, 'name' => 'ยุทธศาสตร์ย่อยที่ ๓.๓ การศึกษาสำหรับทุกคน', 'strategic_id' => 3),
    array('id' => 13, 'name' => 'ยุทธศาสตร์ย่อยที่ ๓.๔ สังคมพหุวัฒนธรรม', 'strategic_id' => 3),
    array('id' => 14, 'name' => 'ยุทธศาสตร์ย่อยที่ ๔.๑ เมืองกรุงเทพมหานครเติบโตอย่างมีระเบียบ มีการใช้ประโยชน์ที่ดินและทรัพยากรอย่างมีประสิทธิภาพ', 'strategic_id' => 4),
    array('id' => 15, 'name' => 'ยุทธศาสตร์ย่อยที่ ๔.๒ กรุงเทพมหานครมีศูนย์ชุมชนย่อย (Sub Center) เป็นระบบตามลำดับความสำคัญ และศักยภาพพื้นที่เป็นโครงข่ายเชื่อมโยงกันอย่างมีระบบ', 'strategic_id' => 4),
    array('id' => 16, 'name' => 'ยุทธศาสตร์ย่อยที่ ๔.๓ กรุงเทพมหานครเป็นเมืองที่มีรูปแบบการจัดการภูมิทัศน์เมืองอย่างยั่งยืน', 'strategic_id' => 4),
    array('id' => 17, 'name' => 'ยุทธศาสตร์ย่อยที่ ๔.๔ กรุงเทพมหานครมีระบบขนส่งมวลชนทั่วถึง สะดวก ประหยัดการจราจรคล่องตัวและมีทางเลือก', 'strategic_id' => 4),
    array('id' => 18, 'name' => 'ยุทธศาสตร์ย่อยที่ ๕.๑ มหานครกรุงเทพแบบบูรณาการ', 'strategic_id' => 5),
    array('id' => 19, 'name' => 'ยุทธศาสตร์ย่อยที่ ๕.๒ พลเมืองขับเคลื่อนมหานคร', 'strategic_id' => 5),
    array('id' => 20, 'name' => 'ยุทธศาสตร์ย่อยที่ ๕.๓ การกระจายอำนาจ', 'strategic_id' => 5),
    array('id' => 21, 'name' => 'ยุทธศาสตร์ย่อยที่ ๕.๔ เมืองสีขาว', 'strategic_id' => 5),
    array('id' => 22, 'name' => 'ยุทธศาสตร์ย่อยที่ ๖.๑ เมืองแห่งโอกาสทางธุรกิจและการลงทุน', 'strategic_id' => 6),
    array('id' => 23, 'name' => 'ยุทธศาสตร์ย่อยที่ ๖.๒ กรุงเทพมหานครเป็นเมืองที่น่าท่องเที่ยวระดับโลก', 'strategic_id' => 6),
    array('id' => 24, 'name' => 'ยุทธศาสตร์ย่อยที่ ๖.๓ เมืองแห่งการจัดประชุมนิทรรศการ', 'strategic_id' => 6),
    array('id' => 25, 'name' => 'ยุทธศาสตร์ย่อยที่ ๗.๑ กฎหมาย', 'strategic_id' => 7),
    array('id' => 26, 'name' => 'ยุทธศาสตร์ย่อยที่ ๗.๒ การบริหารและประเมินผลแผน', 'strategic_id' => 7),
    array('id' => 27, 'name' => 'ยุทธศาสตร์ย่อยที่ ๗.๓ การบริหารทรัพยากรบุคคล', 'strategic_id' => 7),
    array('id' => 28, 'name' => 'ยุทธศาสตร์ย่อยที่ ๗.๔ การคลังและงบประมาณ', 'strategic_id' => 7),
    array('id' => 29, 'name' => 'ยุทธศาสตร์ย่อยที่ ๗.๕ เทคโนโลยีสารสนเทศ', 'strategic_id' => 7)
);

// Insert data into the database
foreach ($data as $record) {
    $DB->insert_record('strategic_sub', (object) $record);
}

// Output success message
redirect(new moodle_url('/admin/tool/bangkok/'), 'เพิ่มปลั๊กอินกรุงเทพมหานครแล้ว', null, \core\output\notification::NOTIFY_SUCCESS);



